//
//
//      uti
//      type/traits.hpp
//

#pragma once

#ifndef UTI_DOXYGEN_SKIP

#include <util/config.hpp>

#ifdef UTI_HAS_STL
#include <type_traits>
#endif


#ifndef UTI_MOVE
#define UTI_MOVE(...) \
        static_cast< typename ::uti::remove_reference_t< decltype(__VA_ARGS__)>&&>(__VA_ARGS__)
#endif

#ifndef UTI_FWD
#define UTI_FWD(...) \
        static_cast< decltype(__VA_ARGS__)&&>(__VA_ARGS__)
#endif



namespace uti
{


////////////////////////////////////////////////////////////////////////////////
///     typedefs
////////////////////////////////////////////////////////////////////////////////

using  i8_t =   signed  char ;
using  u8_t = unsigned  char ;
using i16_t =   signed short ;
using u16_t = unsigned short ;
using i32_t =   signed   int ;
using u32_t = unsigned   int ;
using i64_t =   signed  long ;
using u64_t = unsigned  long ;

static_assert( sizeof(  i8_t ) == 1 ) ;
static_assert( sizeof(  u8_t ) == 1 ) ;
static_assert( sizeof( i16_t ) == 2 ) ;
static_assert( sizeof( u16_t ) == 2 ) ;
static_assert( sizeof( i32_t ) == 4 ) ;
static_assert( sizeof( u32_t ) == 4 ) ;
static_assert( sizeof( i64_t ) == 8 ) ;
static_assert( sizeof( u64_t ) == 8 ) ;

constexpr  u8_t  u8_t_max { 0x00000000000000FF } ;
constexpr u16_t u16_t_max { 0x000000000000FFFF } ;
constexpr u32_t u32_t_max { 0x00000000FFFFFFFF } ;
constexpr u64_t u64_t_max { 0xFFFFFFFFFFFFFFFF } ;

constexpr  i8_t  i8_t_max { 0x000000000000007F } ;
constexpr i16_t i16_t_max { 0x0000000000007FFF } ;
constexpr i32_t i32_t_max { 0x000000007FFFFFFF } ;
constexpr i64_t i64_t_max { 0x7FFFFFFFFFFFFFFF } ;

constexpr  u8_t  u8_t_min { 0x0000000000000000 } ;
constexpr u16_t u16_t_min { 0x0000000000000000 } ;
constexpr u32_t u32_t_min { 0x0000000000000000 } ;
constexpr u64_t u64_t_min { 0x0000000000000000 } ;

constexpr  i8_t  i8_t_min { - i8_t_max - 1 } ;
constexpr i16_t i16_t_min { -i16_t_max - 1 } ;
constexpr i32_t i32_t_min { -i32_t_max - 1 } ;
constexpr i64_t i64_t_min { -i64_t_max - 1 } ;

using  size_t = u64_t ;
using ssize_t = i64_t ;

constexpr  size_t  size_t_max { u64_t_max } ;
constexpr  size_t  size_t_min { u64_t_min } ;
